app/views/sum/expenditure_sum.html.erb

SELECT SUM("expenditure_amounts"."amount") FROM "expenditure_amounts" WHERE "expenditure_amounts"."date" BETWEEN ? AND ?  [["date", "2023-09-01"], ["date", "2023-09-30"]]
---
<h1>今月の支出</h1>
<%= ExpenditureAmount.where(date: Time.zone.today.all_month).sum(:amount) %>円