app/views/sum/income_sum.html.erb

  <% if
    ( com = @income_amounts.sum(:amount) - current_user.income_amounts.where(
                                            date: Time.new(params[:year], params["date(2i)"], params["date(3i)"]).months_ago(1).all_month
                                            ).sum(:amount) ) >= 0 %>
---
SELECT SUM("income_amounts"."amount") FROM "income_amounts" WHERE "income_amounts"."date" BETWEEN ? AND ? AND "income_amounts"."user_id" = ?  [["date", "2023-09-01"], ["date", "2023-09-30"], ["user_id", 1]]