app/views/sum/income_sum.html.erb

SELECT SUM("income_amounts"."amount") FROM "income_amounts" WHERE "income_amounts"."date" BETWEEN ? AND ?  [["date", "2023-09-01"], ["date", "2023-09-30"]]
---
<h1>今月の収入</h1>
<%= IncomeAmount.where(date: Time.zone.today.all_month).sum(:amount) %>円