app/views/expenditure_amounts/index.html.erb

SELECT "expenditures".* FROM "expenditures" WHERE "expenditures"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
<% provide(:title, "支出科目の金額") %>
<h1><%= Expenditure.find(params[:format]).name%>の金額一覧</h1>