app/views/income_amounts/index.html.erb

<% provide(:title, "収入科目の金額") %>
<h1>今月の<%= Income.find(params[:format]).name%>の金額一覧</h1>
<% if current_user.income_amounts.where(date: Time.zone.today.all_month, income_id: params[:format]).present? %>
  <% current_user.income_amounts.where(date: Time.zone.today.all_month, income_id: params[:format]).each do |ia| %>
---
SELECT "incomes".* FROM "incomes" WHERE "incomes"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
SELECT "income_amounts".* FROM "income_amounts" WHERE "income_amounts"."income_id" = ? ORDER BY "income_amounts"."date" ASC  [["income_id", 23]]