app/controllers/expenditure_amounts_controller.rb

  def create
    @expenditure_amount = current_user.expenditure_amounts.create(expenditure_amount_params)
---
INSERT INTO "expenditure_amounts" ("date", "amount", "expenditure_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["date", "2023-09-03"], ["amount", 1000], ["expenditure_id", 1], ["created_at", "2023-09-03 14:37:50.791378"], ["updated_at", "2023-09-03 14:37:50.791378"], ["user_id", 2]]

  def index
    @expenditure_amounts = ExpenditureAmount.order(:date)
---
SELECT "expenditure_amounts".* FROM "expenditure_amounts" WHERE "expenditure_amounts"."expenditure_id" = ? ORDER BY "expenditure_amounts"."date" ASC  [["expenditure_id", 3]]

  def edit
    @expenditure_amount = ExpenditureAmount.find(params[:id])
---
SELECT "expenditure_amounts".* FROM "expenditure_amounts" WHERE "expenditure_amounts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @expenditure_amount = ExpenditureAmount.find(params[:id])
    if @expenditure_amount.update(expenditure_amount_params)
---
SELECT "expenditure_amounts".* FROM "expenditure_amounts" WHERE "expenditure_amounts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "expenditure_amounts" SET "amount" = ?, "updated_at" = ? WHERE "expenditure_amounts"."id" = ?  [["amount", 99], ["updated_at", "2023-08-31 05:45:21.283837"], ["id", 1]]