app/controllers/expenditures_controller.rb

  def create
    @expenditure = current_user.expenditures.build(expenditure_params)
    if @expenditure.save
---
INSERT INTO "expenditures" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "a"], ["user_id", 1], ["created_at", "2023-08-30 19:07:14.553592"], ["updated_at", "2023-08-30 19:07:14.553592"]]

  def index
    @expenditures = current_user.expenditures.order(:name)
---
SELECT "expenditures".* FROM "expenditures" WHERE "expenditures"."user_id" = ? ORDER BY "expenditures"."name" ASC  [["user_id", 1]]

  def edit
    @expenditure = current_user.expenditures.find_by(id: params[:id])
---
SELECT "expenditures".* FROM "expenditures" WHERE "expenditures"."user_id" = ? AND "expenditures"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]

  def update
    @expenditure = current_user.expenditures.find_by(id: params[:id])
    if @expenditure.update(expenditure_params)
---
SELECT "expenditures".* FROM "expenditures" WHERE "expenditures"."user_id" = ? AND "expenditures"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
UPDATE "expenditures" SET "name" = ?, "updated_at" = ? WHERE "expenditures"."id" = ?  [["name", "b"], ["updated_at", "2023-08-30 19:07:29.220408"], ["id", 2]]

  def destroy
    @expenditure.destroy
---
DELETE FROM "expenditures" WHERE "expenditures"."id" = ?  [["id", 1]]

    def correct_user
      @expenditure = current_user.expenditures.find_by(id: params[:id])
---
SELECT "expenditures".* FROM "expenditures" WHERE "expenditures"."user_id" = ? AND "expenditures"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]