app/controllers/income_amounts_controller.rb

  def edit
    @income_amount = current_user.income_amounts.find(params[:id])
---
SELECT "incomes".* FROM "incomes" WHERE "incomes"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]

    def correct_user
      @income_amount = current_user.income_amounts.find_by(id: params[:id])
---
SELECT "incomes".* FROM "incomes" WHERE "incomes"."user_id" = ? AND "incomes"."id" IS NULL LIMIT ?  [["user_id", 1], ["LIMIT", 1]]