app/controllers/income_amounts_controller.rb

INSERT INTO "income_amounts" ("date", "amount", "income_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["date", "2023-09-03"], ["amount", 10000], ["income_id", 1], ["created_at", "2023-09-03 14:10:44.195986"], ["updated_at", "2023-09-03 14:10:44.195986"], ["user_id", 1]]
---
  def create
    @income_amount = current_user.income_amounts.create(income_amount_params)

SELECT "income_amounts".* FROM "income_amounts" WHERE "income_amounts"."income_id" = ? ORDER BY "income_amounts"."date" ASC  [["income_id", 23]]
---
  def index
    @income_amounts = IncomeAmount.order(:date)

SELECT "income_amounts".* FROM "income_amounts" WHERE "income_amounts"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
  def edit
    @income_amount = IncomeAmount.find(params[:id])

SELECT "income_amounts".* FROM "income_amounts" WHERE "income_amounts"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "income_amounts" SET "amount" = ?, "updated_at" = ? WHERE "income_amounts"."id" = ?  [["amount", 9], ["updated_at", "2023-08-31 05:44:59.655955"], ["id", 13]]
---
  def update
    @income_amount = IncomeAmount.find(params[:id])
    if @income_amount.update(income_amount_params)

SELECT "income_amounts".* FROM "income_amounts" WHERE "income_amounts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "income_amounts" WHERE "income_amounts"."id" = ?  [["id", 1]]
---
  def destroy
    @income_amount = IncomeAmount.find(params[:id])
    @income_amount.destroy