app/controllers/incomes_controller.rb

INSERT INTO "incomes" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "あ"], ["user_id", 1], ["created_at", "2023-08-30 14:27:33.101478"], ["updated_at", "2023-08-30 14:27:33.101478"]]
---
  def create
    @income = current_user.incomes.build(income_params)
    if @income.save

SELECT "incomes".* FROM "incomes" WHERE "incomes"."user_id" = ? ORDER BY "incomes"."name" ASC  [["user_id", 1]]
---
  def index
    @incomes = current_user.incomes.order(:name)

SELECT "incomes".* FROM "incomes" WHERE "incomes"."user_id" = ? AND "incomes"."id" = ? LIMIT ?  [["user_id", 1], ["id", 19], ["LIMIT", 1]]
---
  def edit
    @income = current_user.incomes.find_by(id: params[:id])

SELECT "incomes".* FROM "incomes" WHERE "incomes"."user_id" = ? AND "incomes"."id" = ? LIMIT ?  [["user_id", 1], ["id", 21], ["LIMIT", 1]]
UPDATE "incomes" SET "name" = ?, "updated_at" = ? WHERE "incomes"."id" = ?  [["name", "お"], ["updated_at", "2023-08-30 15:29:11.005323"], ["id", 21]]
---
  def update
    @income = current_user.incomes.find_by(id: params[:id])
    if @income.update(income_params)

DELETE FROM "incomes" WHERE "incomes"."id" = ?  [["id", 19]]
---
  def destroy
    @income.destroy

SELECT "incomes".* FROM "incomes" WHERE "incomes"."user_id" = ? AND "incomes"."id" = ? LIMIT ?  [["user_id", 1], ["id", 19], ["LIMIT", 1]]
---
    def correct_user
      @income = current_user.incomes.find_by(id: params[:id])