app/controllers/sum_controller.rb

  def income_sum
    if params["date(1i)"].present?
      @income_amounts = current_user.income_amounts.where(date: Time.new(params[:year], params["date(2i)"], params["date(3i)"]).all_month).order(:date)
---
SELECT SUM("income_amounts"."amount") FROM "income_amounts" WHERE "income_amounts"."date" BETWEEN ? AND ? AND "income_amounts"."user_id" = ?  [["date", "2023-09-01"], ["date", "2023-09-30"], ["user_id", 1]]

  def expenditure_sum
    if params["date(1i)"].present?
      @expenditure_amounts = current_user.expenditure_amounts.where(date: Time.new(params[:year], params["date(2i)"], params["date(3i)"]).all_month).order(:date)
---
SELECT SUM("expenditure_amounts"."amount") FROM "expenditure_amounts" WHERE "expenditure_amounts"."date" BETWEEN ? AND ?  [["date", "2023-09-01"], ["date", "2023-09-30"]]